app/controllers/admin/portfolios_controller.rb

  def create
    @portfolio = Portfolio.new(portfolio_params)

      if @portfolio.save
---
INSERT INTO "portfolios" ("name", "degree", "phone", "professional_history", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["degree", ""], ["phone", ""], ["professional_history", ""], ["avatar", ""], ["created_at", "2016-07-31 11:49:23.347324"], ["updated_at", "2016-07-31 11:49:23.347324"]]

  def update
      if @portfolio.update(portfolio_params)
---
UPDATE "portfolios" SET "phone" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["phone", "(82) 6546-5432"], ["updated_at", "2016-07-31 13:13:21.541560"], ["id", 4]]

  def destroy
    @portfolio.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 5]]

    def set_portfolio
      @portfolio = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", 5]]