app/controllers/home_controller.rb

  def index
    @portfolio = Portfolio.find(4)
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT 1  [["id", 4]]